
public class Hello_05 {

	public static void main(String[] args) {

		/*
		 * 변수 선언문
		 * 정수형 어떤 값을 기억장소에 저장할수 있도록
		 * 기억장소를 예약하고
		 * 이름을 num1으로 선언한다
		 * 그리고 num1으로 선언된 기억장소에
		 * 정수 30을 보관하라
		 */
		int num1 = 30;
		
		/*
		 * 변수 선언문
		 * 실수형 어떤 값을 기억장소에 저장할수 있도록
		 * 기억장소를 예약하고
		 * 이름을 num2로 선언한다.
		 * 그리고 num2로 선언된 기억장소에
		 * 실수 30.2를 보관하라
		 */
		double num2 = 30.2;
		
		/*
		 * 변수 선언문
		 * 문자열형 어떤 값을 기억장소에 저장할수 있도록
		 * 기억장소를 예약하고
		 * 이름을 name1으로 선언한다.
		 * 그리고 name1으로 선언된 기억장소에
		 * 문자열 홍길동 을 보관하라
		 * 
		 * String 키워드는 클래스(첫글자 대문자)이면서
		 * 변수를 선언하는 선언 명령문(키워드)로 사용된다.
		 */
		String name1 = "홍길동";

		
		
	}

}
